[
  "table-editor-obsidian",
  "obsidian-auto-link-title",
  "code-styler",
  "obsidian-emoji-toolbar",
  "oz-image-plugin",
  "omnisearch",
  "obsidian-paste-to-current-indentation",
  "terminal",
  "obsidian-html-tags-autocomplete",
  "obsidian-html-plugin",
  "obsidian-excalidraw-plugin",
  "obsidian-table-generator",
  "sheets"
]